[
  {
    "id": 1,
    "course_id": 1,
    "title": "Intro",
    "content": "Before we start with the first topic, you should understand what awaits you on your journey into the knowledge of the Coderealm. \n Imagine you are building a house. First you build a shell - the walls, the floor. You can live in it, but it's not pretty or functional yet, so you'll probably lay wooden flooring and paint the walls - and what's a house without furniture? But now you still need electricity, heating and maybe even a whole smart home! Last but not least, there's a shed where you can store things. \n You might be wondering what this is all about. You wanted to create websites, SAVE THE CODEREALM and not build houses. Yes ... you will, but first understand what you will learn. A website is like this house you need a shell, which is the HTML. Then you can style this shell with CSS. You get the functionality with Javascript and you can compare the shed with the backend. \n \n I hope you now understand a little better what to expect. So let's get straight into the adventure ...",
    "example": "text"
  },
  {
    "id": 2,
    "course_id": 1,
    "title": "HTML-Basics",
    "content": "Let's start with the basics of the shell. HTML is an abbreviation for HyperText Markup Language.\n\n <strong>HyperText</strong> refers to the way in which Web pages are linked together. Thus, the link available on a webpage is called 'HyperText'. \n <strong>Markup Language</strong>, which means you use HTML to simple 'mark up' a text document with tags that tell a Web browser how to structure it to display. \n\n Each HTML file consists of: \n \n <strong>&lt;!DOCTYPE html&gt;</strong> – Tells the browser that this is an HTML5 document. \n <strong>&lt;html&gt; ... &lt;/html&gt;</strong> – The root element of the page. This includes all information that is to be processed by the browser. \n <strong>&lt;head&gt; ... &lt;/head&gt;</strong> – Contains meta information (not visible content), e.g. title, character encoding, fonts, little picture for the tab. \n <strong>&lt;title&gt; ... &lt;/title&gt;</strong> – Sets the title of the browser tab. \n <strong>&lt;body&gt; ... &lt;/body&gt;</strong> – Contains all visible content. \n \n Important! \n Every tag has an opening and a closing tag. That means everything which is between those tags belongs to them. Opening tags are <head> or <body>. They only contain the name of the tag. Closing tags always have a ‘/’ - </head> or </body>. Special cases are self-closing tags - but we will come to these later.",
    "example": "<!DOCTYPE html> <html> <head><title>...</title></head><body>...</body>"
  },
  {
    "id": 3,
    "course_id": 1,
    "title": "First Tags - text, lists, links and images",
    "content": "The most exciting part is the body. Commands are written in it with different tags that cause things to be displayed on the website. \n These tags describe elements within the HTML. You can distinguish between two types of these elements: Block and inline elements. \n Here you will find an overview of the most common and important tags: \n \n <strong>Block elements</strong> always start on a new line, take up the full width of their parent element (elements in which they are located) and can contain other block and inline elements. \n <strong>Inline elements</strong> remain on the same line as the surrounding text, only take up as much space as they need and cannot contain block elements, only text or other inline elements. \n \n Common & important HTML Tags \n <strong>&lt;h1> to &lt;h6></strong> = Headings (from most to least important) \n <strong>&lt;p></strong> = Paragraph \n <strong>&lt;a href='url'></strong> = Link to another page or website \n <strong>&lt;img src='url' alt='text' /></strong> = Image \n <strong>&lt;ul>, &lt;ol>, &lt;li></strong> = Unordered list, ordered list, list item \n <strong>&lt;div></strong> = Generic container for layout/design \n <strong>&lt;span></strong> = Inline container for styling text \n <strong>&lt;strong>, &lt;em></strong> = Bold (strong) and italic (em) text \n <strong>&lt;br></strong> = Line break \n <strong>&lt;input>, &lt;form>, &lt;label>, &lt;button></strong> = Form elements \n <strong>&lt;table>, `&lt;r>, &lt;td>, &lt;th><7strong> = Table elements",
    "example": "<!DOCTYPE html><html><head><title>My First Website</title></head><body><h1>Eat more fruits!</h1><ul><li>Oranges</li><li>Apples</li><li>Bananasy</li></ul><a href='https://example.com'>A link</a><img src='https://example-picture.com' /></body></html>"
  },
  {
    "id": 4,
    "course_id": 1,
    "title": "Forms and Input",
    "content": "It's hard to believe, but forms can be found on the Internet more often than you might think. Every field in which you can enter something or boxes that you can check are part of forms. You already used one on your own when you registered with Coderealm. \n That's why it's important to know how to use them. \n\n Forms consist of a basic structure. This is the <strong>&lt;form></strong> tag - this consists of an opening and closing tag. All information about this form is written between the two tags. The first step is to define a <strong>&lt;label> ... &lt;/label></strong>. This is where you specify which heading or label the following field should have. This is displayed on the web page. \n  After the label comes the most exciting part of the form - now it becomes interactive with the user. This is the <strong>&lt;input ... /></strong>. Within the tag, you define the type, the id and the name. With the type you tell the browser what kind of input it can calculate with. Words, a mail address or numbers. The id and the name are interesting for the styling and the functionality - this comes in the later modules. \n \n Most important types: \n - text = one line text \n - email \n - password \n - number \n \n Other elements like <strong>&lt;input></strong>: \n - <strong>&lt;textarea></strong> = multiline text \n - <strong>&lt;select></strong> with <strong>&lt;option></strong>= Dropdown menu \n \n Of course, a form is only really usefull when you can send everything with a <strong>&lt;button> ...<strong>&lt;/button></strong> - we'll learn how to send it later, but for now let's create the button. The button must also be given a type so that it knows what to do later when it is pressed. ",
    "example": "<form><label for='name'>Name:</label><input type='text' id='name' name='username' /><button type='submit'>Send</button></form>"
  },
  {
    "id": 5,
    "course_id": 2,
    "title": "CSS Basics",
    "content": "Now we know the basics of HTML. Great ... the shell of our house is finished. Now it's time to furnish it ... we're learning CSS! \n CSS stands for Cascading Style Sheets and is used to design HTML elements: Colours, spacing, fonts, etc. \n \n How to use: \n 1. Inline: directly inside the tag (not recommended!): \n &lt;p style='color: red;'>Text&lt;/p> \n  2. In the &lt;style> tag within &lt;head>: \n &lt;style> p { color: red; } &lt;/style> \n  3. In an external `.css` file. \n \n Selectors \n Within the CSS, you must first define what you want to style in the HTML. We have to choose the selectors. To do this, you have the option of selecting the element, the class or the ID. \n \n If you select the <strong>element</strong>, all elements of this type on the website will be customised according to the specifications. <strong>Classes and IDs</strong> are specified by us - when writing the HTML. We can give individual elements the same class in order to style them uniformly. IDs are only used for a specific element. You cannot give an element an ID that has already been applied. \n \n In html we name the elements with class=‘className’ or id=‘idName’ in the respective tag. In CSS, the classes are displayed with a dot `.className {..}` and IDs with a hashtag `#idName {..}` \n \n Once we have defined the selector, we enter the values we need in the {} to style it the way we want. We will learn an overview of possible properties in the coming lessons.",
    "example": "<h1>Best heading ever!</h1><p class='intro'>This is the intro paragraphe!</p><p id='outro'>This is the outro paragraph!</p>//css h1 {color: blue;}.intro {font-size: 24px;} #outro {background-color: green}"
  },
  {
    "id": 6,
    "course_id": 2,
    "title": "Box-Model, margin, padding and border",
    "content": "Each HTML element is displayed in the browser as a box. This box has four areas: \n \n <ul><li> - content: The actual content (e.g. text or images).</li><li> - padding:  Distance within the box </li><li> - border: frame </li><li> - margin: Distance outside the box</li></ul>",
    "example": "div {padding: 10px; border: 2px solid black; margin: 20px;}"
  },
  {
    "id": 7,
    "course_id": 2,
    "title": "Layout with flexbox",
    "content": "Flexbox (short for Flexible Box Layout) is a CSS layout module that makes it easier to arrange elements within a container dynamically and efficiently - both in rows and columns. It was developed to solve problems with the alignment and distribution of space in containers. \n \n Basic principles: \n Flexbox consists of two levels: \n 1. <strong>flex container</strong> - the element on which display: flex is set \n 2. <strong>flex items</strong> - the direct children of this container \n \n Most important features: \n For flex container: \n - '<strong>display: flex</strong>' Makes an element to an flex container \n - '<strong>flex-direction</strong>' directions of the axis : row (default), column, row-reverse, column-reverse \n - '<strong>justify-content</strong>' Distribution along the main axis (z. B. flex-start, center, - space-between, space-around, space-evenly) \n - '<strong>align-items</strong>' Distribution along the cross axis (z. B. stretch, flex-start, center, baseline) \n - '<strong>flex-wrap</strong>' line break: nowrap (Standard), wrap, wrap-reverse \n - '<strong>gap</strong>' Space between items \n \n For flex items: \n - '<strong>flex-grow</strong>' How much an item can grow if space is available \n - '<strong>flex-shrink</strong>' How much an item an item can shrink if space isn't available \n - '<strong>flex-basis</strong>' Size at the beginning(auto, 0, 100px esc.) \n - '<strong>flex</strong>' Shortcut: flex-grow flex-shrink flex-basis (flex: 1 0 200px) \n - '<strong>align-self</strong>' Overwright align-items just for this item \n \n When do I use flexbox? \n - If you want to align elements in a single row or column \n - For buttons in a bar, cards next to each other, navigations, centring \n - If you need responsive behaviour without a lot of media queries",
    "example": ".container {display: flex; justify-content: space-between; align-items: center; height: 200px;} .item {flex: 1; margin: 10px;}"
  },
  {
    "id": 8,
    "course_id": 2,
    "title": "Responsive design & media queries",
    "content": "Responsive design means that websites or web applications are designed in such a way that they automatically adapt to different screen sizes and devices - whether smartphone, tablet, laptop or large desktop screen. \n \n Goal: \n The user interface (UI) should look good and be usable everywhere without having to zoom or scroll to recognise content or operate buttons. \n \n Important principles: \n \n Flexible layouts (fluid grids): \n - Instead of fixed pixel values, relative units such as em, % or vw/vh are used. \n - Example: Instead of width: 600px, use width: 80%. \n \n Flexible images and media: \n - Images and videos adapt to the width of their container. \n - Example: img { max-width: 100%; height: auto; } \n \n Media queries (CSS): \n - This allows you to define styles specifically for certain screen sizes or devices. \n \n Mobile first approach: \n - You first develop for small screens and then expand for larger screens. \n - Advantage: better performance and better user-friendliness on mobile devices.",
    "example":"@media (max-width: 600px) {body {background-color: lightyellow;}}"
  },
  {
    "id": 9,
    "course_id": 2,
    "title": "FINAL",
    "content": "You now have everything you need to build a small website! \n Plan the structure: \n - title and headings \n - text \n - images \n - links \n - lists \n - forms  \n  \n Style it with CSS: \n - colors, distances \n - flexbox for layout \n - media query for the mobile version",
    "example":"<!DOCTYPE html><html lang='en'><head><meta charset='UTF-8' /><title>Red Pandas</title><style>body {font-family: Arial, sans-serif; background-color: #f7f5f2; color: #333; padding: 20px;} h1 {color: #d94f30; text-align: center;} img {display: block; margin: 0 auto; width: 300px; border-radius: 8px;} ul {background-color: #fff3e6; padding: 15px; order-radius: 5px; max-width: 400px; margin: 20px auto; } form {background-color: #e0f7fa; padding: 15px; border-radius: 5px; max-width: 400px; margin: 20px auto;} label, input {display: block; margin-bottom: 10px;} a {color: #d94f30; text-decoration: none;} </style></head><body><h1>Red Pandas – The Cutest Animal</h1> <p>Red pandas are small mammals native to the Himalayas. They are known for their reddish fur, long bushy tails, and playful nature.</p> <img src='https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/RedPandaFullBody.JPG/800px-RedPandaFullBody.JPG' alt='Red panda standing on a log' /> <ul><li>Live in the Himalayas</li><li>Eat mostly bamboo</li><li>Active at dawn and dusk</li></ul><p>Learn more about red pandas on <a href='https://en.wikipedia.org/wiki/Red_panda' target='blank'>Wikipedia</a>.</p><form><label for='name'>Your Name:</label><input type='text' id='name' name='name' /><label for='email'>Your Email:</label><input type='email id='email' name='email' /><input type='submit' value='Submit' /></form></body></html>"
  }
]
